---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.DesignPowerLoad
source: html/3906ca00-6a84-f638-0e68-fd4c82dc000e.htm
---
# Autodesk.Revit.DB.Mechanical.Space.DesignPowerLoad Property

Get or set the Design Power Load of the Space.

## Syntax (C#)
```csharp
public double DesignPowerLoad { get; set; }
```

## Remarks
This property is used to get or set the Design Power Load of the Space.